> tribble(1)
Error: Must specify at least one column using the `~name` syntax.

> tribble(~a, ~b, 1)
Error: Data must be rectangular.
* Found 2 columns.
* Found 1 cells.
i 1 is not an integer multiple of 2.

> tribble(a ~ b, 1)
Error: All column specifications must use the `~name` syntax.
x Found `a` on the left-hand side of `~`.

> tribble(a ~ b + c, 1)
Error: All column specifications must use the `~name` syntax.
x Found `a` on the left-hand side of `~`.

> tribble(~b, 1, "a")
Error: Can't create column `b`: Can't combine `..1` <double> and `..2` <character>.

> frame_matrix(1)
Error: Must specify at least one column using the `~name` syntax.

> frame_matrix(~a, list(1))
Error: All values must be atomic.
x Found list-valued element at position 1.

